MightyDevices/startup-stm32l433/stm32l433/adc.h
/*  Bit definition for ADC_SMPR2 register  */
#define ADC_SMPR2_SMP10                     (0x00000007)
#define ADC_SMPR2_SMP10_0                   (0x00000001)
#define ADC_SMPR2_SMP10_1                   (0x00000002)
#define ADC_SMPR2_SMP10_2                   (0x00000004)
#define ADC_SMPR2_SMP10_2CLK5               (0x00000000)
#define ADC_SMPR2_SMP10_6CLK5               (0x00000001)
#define ADC_SMPR2_SMP10_12CLK5              (0x00000002)
#define ADC_SMPR2_SMP10_24CLK5              (0x00000003)
#define ADC_SMPR2_SMP10_47CLK5              (0x00000004)
#define ADC_SMPR2_SMP10_92CLK5              (0x00000005)
#define ADC_SMPR2_SMP10_247CLK5             (0x00000006)
#define ADC_SMPR2_SMP10_640CLK5             (0x00000007)
#define ADC_SMPR2_SMP11                     (0x00000038)
#define ADC_SMPR2_SMP11_0                   (0x00000008)
#define ADC_SMPR2_SMP11_1                   (0x00000010)
#define ADC_SMPR2_SMP11_2                   (0x00000020)
#define ADC_SMPR2_SMP11_2CLK5               (0x00000000)
#define ADC_SMPR2_SMP11_6CLK5               (0x00000008)
#define ADC_SMPR2_SMP11_12CLK5              (0x00000010)
#define ADC_SMPR2_SMP11_24CLK5              (0x00000018)
#define ADC_SMPR2_SMP11_47CLK5              (0x00000020)
#define ADC_SMPR2_SMP11_92CLK5              (0x00000028)
#define ADC_SMPR2_SMP11_247CLK5             (0x00000030)
#define ADC_SMPR2_SMP11_640CLK5             (0x00000038)
#define ADC_SMPR2_SMP12                     (0x000001C0)
#define ADC_SMPR2_SMP12_0                   (0x00000040)
#define ADC_SMPR2_SMP12_1                   (0x00000080)
#define ADC_SMPR2_SMP12_2                   (0x00000100)
#define ADC_SMPR2_SMP12_2CLK5               (0x00000000)
#define ADC_SMPR2_SMP12_6CLK5               (0x00000040)
#define ADC_SMPR2_SMP12_12CLK5              (0x00000080)
#define ADC_SMPR2_SMP12_24CLK5              (0x000000C0)
#define ADC_SMPR2_SMP12_47CLK5              (0x00000100)
#define ADC_SMPR2_SMP12_92CLK5              (0x00000140)
#define ADC_SMPR2_SMP12_247CLK5             (0x00000180)
#define ADC_SMPR2_SMP12_640CLK5             (0x000001C0)
#define ADC_SMPR2_SMP13                     (0x00000E00)
#define ADC_SMPR2_SMP13_0                   (0x00000200)
#define ADC_SMPR2_SMP13_1                   (0x00000400)
#define ADC_SMPR2_SMP13_2                   (0x00000800)
#define ADC_SMPR2_SMP13_2CLK5               (0x00000000)
#define ADC_SMPR2_SMP13_6CLK5               (0x00000200)
#define ADC_SMPR2_SMP13_12CLK5              (0x00000400)
#define ADC_SMPR2_SMP13_24CLK5              (0x00000600)
#define ADC_SMPR2_SMP13_47CLK5              (0x00000800)
#define ADC_SMPR2_SMP13_92CLK5              (0x00000A00)
#define ADC_SMPR2_SMP13_247CLK5             (0x00000C00)
#define ADC_SMPR2_SMP13_640CLK5             (0x00000E00)
#define ADC_SMPR2_SMP14                     (0x00007000)
#define ADC_SMPR2_SMP14_0                   (0x00001000)
#define ADC_SMPR2_SMP14_1                   (0x00002000)
#define ADC_SMPR2_SMP14_2                   (0x00004000)
#define ADC_SMPR2_SMP14_2CLK5               (0x00000000)
#define ADC_SMPR2_SMP14_6CLK5               (0x00001000)
#define ADC_SMPR2_SMP14_12CLK5              (0x00002000)
#define ADC_SMPR2_SMP14_24CLK5              (0x00003000)
#define ADC_SMPR2_SMP14_47CLK5              (0x00004000)
#define ADC_SMPR2_SMP14_92CLK5              (0x00005000)
#define ADC_SMPR2_SMP14_247CLK5             (0x00006000)
#define ADC_SMPR2_SMP14_640CLK5             (0x00007000)
#define ADC_SMPR2_SMP15                     (0x00038000)
#define ADC_SMPR2_SMP15_0                   (0x00008000)
#define ADC_SMPR2_SMP15_1                   (0x00010000)
#define ADC_SMPR2_SMP15_2                   (0x00020000)
#define ADC_SMPR2_SMP15_2CLK5               (0x00000000)
#define ADC_SMPR2_SMP15_6CLK5               (0x00008000)
#define ADC_SMPR2_SMP15_12CLK5              (0x00010000)
#define ADC_SMPR2_SMP15_24CLK5              (0x00018000)
#define ADC_SMPR2_SMP15_47CLK5              (0x00020000)
#define ADC_SMPR2_SMP15_92CLK5              (0x00028000)
#define ADC_SMPR2_SMP15_247CLK5             (0x00030000)
#define ADC_SMPR2_SMP15_640CLK5             (0x00038000)
#define ADC_SMPR2_SMP16                     (0x001C0000)
#define ADC_SMPR2_SMP16_0                   (0x00040000)
#define ADC_SMPR2_SMP16_1                   (0x00080000)
#define ADC_SMPR2_SMP16_2                   (0x00100000)
#define ADC_SMPR2_SMP16_2CLK5               (0x00000000)
#define ADC_SMPR2_SMP16_6CLK5               (0x00040000)
#define ADC_SMPR2_SMP16_12CLK5              (0x00080000)
#define ADC_SMPR2_SMP16_24CLK5              (0x000C0000)
#define ADC_SMPR2_SMP16_47CLK5              (0x00100000)
#define ADC_SMPR2_SMP16_92CLK5              (0x00140000)
#define ADC_SMPR2_SMP16_247CLK5             (0x00180000)
#define ADC_SMPR2_SMP16_640CLK5             (0x001C0000)
#define ADC_SMPR2_SMP17                     (0x00E00000)
#define ADC_SMPR2_SMP17_0                   (0x00200000)
#define ADC_SMPR2_SMP17_1                   (0x00400000)
#define ADC_SMPR2_SMP17_2                   (0x00800000)
#define ADC_SMPR2_SMP17_2CLK5               (0x00000000)
#define ADC_SMPR2_SMP17_6CLK5               (0x00200000)
#define ADC_SMPR2_SMP17_12CLK5              (0x00400000)
#define ADC_SMPR2_SMP17_24CLK5              (0x00600000)
#define ADC_SMPR2_SMP17_47CLK5              (0x00800000)
#define ADC_SMPR2_SMP17_92CLK5              (0x00A00000)
#define ADC_SMPR2_SMP17_247CLK5             (0x00C00000)
#define ADC_SMPR2_SMP17_640CLK5             (0x00E00000)
#define ADC_SMPR2_SMP18                     (0x07000000)
#define ADC_SMPR2_SMP18_0                   (0x01000000)
#define ADC_SMPR2_SMP18_1                   (0x02000000)
#define ADC_SMPR2_SMP18_2                   (0x04000000)
#define ADC_SMPR2_SMP18_2CLK5               (0x00000000)
#define ADC_SMPR2_SMP18_6CLK5               (0x01000000)
#define ADC_SMPR2_SMP18_12CLK5              (0x02000000)
#define ADC_SMPR2_SMP18_24CLK5              (0x03000000)
#define ADC_SMPR2_SMP18_47CLK5              (0x04000000)
#define ADC_SMPR2_SMP18_92CLK5              (0x05000000)
#define ADC_SMPR2_SMP18_247CLK5             (0x06000000)
#define ADC_SMPR2_SMP18_640CLK5             (0x07000000)

/*  Bit definition for ADC_TR1 register  */
#define ADC_TR1_LT1                         (0x00000FFF)
#define ADC_TR1_HT1                         (0x0FFF0000)

/*  Bit definition for ADC_TR2 register  */
#define ADC_TR2_LT2                         (0x000000FF)
#define ADC_TR2_HT2                         (0x00FF0000)

/*  Bit definition for ADC_TR3 register  */
#define ADC_TR3_LT3                         (0x000000FF)
#define ADC_TR3_HT3                         (0x00FF0000)

