MightyDevices/startup-stm32l433/stm32l433/adc.h
/*  Bit definition for ADC_SQR1 register  */
#define ADC_SQR1_L                          (0x0000000F)
#define ADC_SQR1_SQ1                        (0x000007C0)
#define ADC_SQR1_SQ2                        (0x0001F000)
#define ADC_SQR1_SQ3                        (0x007C0000)
#define ADC_SQR1_SQ4                        (0x1F000000)

/*  Bit definition for ADC_SQR2 register  */
#define ADC_SQR2_SQ5                        (0x0000001F)
#define ADC_SQR2_SQ6                        (0x000007C0)
#define ADC_SQR2_SQ7                        (0x0001F000)
#define ADC_SQR2_SQ8                        (0x007C0000)
#define ADC_SQR2_SQ9                        (0x1F000000)

/*  Bit definition for ADC_SQR3 register  */
#define ADC_SQR3_SQ10                       (0x0000001F)
#define ADC_SQR3_SQ11                       (0x000007C0)
#define ADC_SQR3_SQ12                       (0x0001F000)
#define ADC_SQR3_SQ13                       (0x007C0000)
#define ADC_SQR3_SQ14                       (0x1F000000)

/*  Bit definition for ADC_SQR4 register  */
#define ADC_SQR4_SQ15                       (0x0000001F)
#define ADC_SQR4_SQ16                       (0x000007C0)

/*  Bit definition for ADC_DR register  */
#define ADC_DR_RDATA                        (0x0000FFFF)

/*  Bit definition for ADC_JSQR register  */
#define ADC_JSQR_JL                         (0x00000003)
#define ADC_JSQR_JL_0                       (0x00000001)
#define ADC_JSQR_JL_1                       (0x00000002)
#define ADC_JSQR_JEXTSEL                    (0x0000003C)
#define ADC_JSQR_JEXTSEL_0                  (0x00000004)
#define ADC_JSQR_JEXTSEL_1                  (0x00000008)
#define ADC_JSQR_JEXTSEL_2                  (0x00000010)
#define ADC_JSQR_JEXTSEL_3                  (0x00000020)
#define ADC_JSQR_JEXTEN                     (0x000000C0)
#define ADC_JSQR_JEXTEN_0                   (0x00000040)
#define ADC_JSQR_JEXTEN_1                   (0x00000080)
#define ADC_JSQR_JSQ1                       (0x00001F00)
#define ADC_JSQR_JSQ2                       (0x0007C000)
#define ADC_JSQR_JSQ3                       (0x01F00000)
#define ADC_JSQR_JSQ4                       (0x7C000000)

/*  Bit definition for ADC_OFR1 register  */
#define ADC_OFR1_OFFSET1                    (0x00000FFF)
#define ADC_OFR1_OFFSET1_CH                 (0x7C000000)
#define ADC_OFR1_OFFSET1_EN                 (0x80000000)

/*  Bit definition for ADC_OFR2 register  */
#define ADC_OFR2_OFFSET2                    (0x00000FFF)
#define ADC_OFR2_OFFSET2_CH                 (0x7C000000)
#define ADC_OFR2_OFFSET2_EN                 (0x80000000)

/*  Bit definition for ADC_OFR3 register  */
#define ADC_OFR3_OFFSET3                    (0x00000FFF)
#define ADC_OFR3_OFFSET3_CH                 (0x7C000000)
#define ADC_OFR3_OFFSET3_EN                 (0x80000000)

/*  Bit definition for ADC_OFR4 register  */
#define ADC_OFR4_OFFSET4                    (0x00000FFF)
#define ADC_OFR4_OFFSET4_CH                 (0x7C000000)
#define ADC_OFR4_OFFSET4_EN                 (0x80000000)

/*  Bit definition for ADC_JDR1 register  */
#define ADC_JDR1_JDATA                      (0x0000FFFF)

/*  Bit definition for ADC_JDR2 register  */
#define ADC_JDR2_JDATA                      (0x0000FFFF)

/*  Bit definition for ADC_JDR3 register  */
#define ADC_JDR3_JDATA                      (0x0000FFFF)

/*  Bit definition for ADC_JDR4 register  */
#define ADC_JDR4_JDATA                      (0x0000FFFF)

/*  Bit definition for ADC_AWD2CR register  */
#define ADC_AWD2CR_AWD2CH                   (0x0007FFFF)
#define ADC_AWD2CR_AWD2CH_0                 (0x00000001)
#define ADC_AWD2CR_AWD2CH_1                 (0x00000002)
#define ADC_AWD2CR_AWD2CH_2                 (0x00000004)
#define ADC_AWD2CR_AWD2CH_3                 (0x00000008)
#define ADC_AWD2CR_AWD2CH_4                 (0x00000010)
#define ADC_AWD2CR_AWD2CH_5                 (0x00000020)
#define ADC_AWD2CR_AWD2CH_6                 (0x00000040)
#define ADC_AWD2CR_AWD2CH_7                 (0x00000080)
#define ADC_AWD2CR_AWD2CH_8                 (0x00000100)
#define ADC_AWD2CR_AWD2CH_9                 (0x00000200)
#define ADC_AWD2CR_AWD2CH_10                (0x00000400)
#define ADC_AWD2CR_AWD2CH_11                (0x00000800)
#define ADC_AWD2CR_AWD2CH_12                (0x00001000)
#define ADC_AWD2CR_AWD2CH_13                (0x00002000)
#define ADC_AWD2CR_AWD2CH_14                (0x00004000)
#define ADC_AWD2CR_AWD2CH_15                (0x00008000)
#define ADC_AWD2CR_AWD2CH_16                (0x00010000)
#define ADC_AWD2CR_AWD2CH_17                (0x00020000)
#define ADC_AWD2CR_AWD2CH_18                (0x00040000)

/*  Bit definition for ADC_AWD3CR register  */
#define ADC_AWD3CR_AWD3CH                   (0x0007FFFF)
#define ADC_AWD3CR_AWD3CH_0                 (0x00000001)
#define ADC_AWD3CR_AWD3CH_1                 (0x00000002)
#define ADC_AWD3CR_AWD3CH_2                 (0x00000004)
#define ADC_AWD3CR_AWD3CH_3                 (0x00000008)
#define ADC_AWD3CR_AWD3CH_4                 (0x00000010)
#define ADC_AWD3CR_AWD3CH_5                 (0x00000020)
#define ADC_AWD3CR_AWD3CH_6                 (0x00000040)
#define ADC_AWD3CR_AWD3CH_7                 (0x00000080)
#define ADC_AWD3CR_AWD3CH_8                 (0x00000100)
#define ADC_AWD3CR_AWD3CH_9                 (0x00000200)
#define ADC_AWD3CR_AWD3CH_10                (0x00000400)
#define ADC_AWD3CR_AWD3CH_11                (0x00000800)
#define ADC_AWD3CR_AWD3CH_12                (0x00001000)
#define ADC_AWD3CR_AWD3CH_13                (0x00002000)
#define ADC_AWD3CR_AWD3CH_14                (0x00004000)
#define ADC_AWD3CR_AWD3CH_15                (0x00008000)
#define ADC_AWD3CR_AWD3CH_16                (0x00010000)
#define ADC_AWD3CR_AWD3CH_17                (0x00020000)
#define ADC_AWD3CR_AWD3CH_18                (0x00040000)

/*  Bit definition for ADC_DIFSEL register  */
#define ADC_DIFSEL_DIFSEL                   (0x0007FFFF)
#define ADC_DIFSEL_DIFSEL_0                 (0x00000001)
#define ADC_DIFSEL_DIFSEL_1                 (0x00000002)
#define ADC_DIFSEL_DIFSEL_2                 (0x00000004)
#define ADC_DIFSEL_DIFSEL_3                 (0x00000008)
#define ADC_DIFSEL_DIFSEL_4                 (0x00000010)
#define ADC_DIFSEL_DIFSEL_5                 (0x00000020)
#define ADC_DIFSEL_DIFSEL_6                 (0x00000040)
#define ADC_DIFSEL_DIFSEL_7                 (0x00000080)
#define ADC_DIFSEL_DIFSEL_8                 (0x00000100)
#define ADC_DIFSEL_DIFSEL_9                 (0x00000200)
#define ADC_DIFSEL_DIFSEL_10                (0x00000400)
#define ADC_DIFSEL_DIFSEL_11                (0x00000800)
#define ADC_DIFSEL_DIFSEL_12                (0x00001000)
#define ADC_DIFSEL_DIFSEL_13                (0x00002000)
#define ADC_DIFSEL_DIFSEL_14                (0x00004000)
#define ADC_DIFSEL_DIFSEL_15                (0x00008000)
#define ADC_DIFSEL_DIFSEL_16                (0x00010000)
#define ADC_DIFSEL_DIFSEL_17                (0x00020000)
#define ADC_DIFSEL_DIFSEL_18                (0x00040000)

