MightyDevices/startup-stm32l433/stm32l433/adc.h
/*  Bit definition for ADC_CALFACT register  */
#define ADC_CALFACT_CALFACT_S               (0x0000007F)
#define ADC_CALFACT_CALFACT_D               (0x007F0000)

/* common registers */
typedef struct {
    reg32_t CSR;
    reg32_t RESERVED;
    reg32_t CCR;
} PACKED ALIGNED(4) adc_com_t;

/*  ADC Common registers  */
/*  Bit definition for ADC_CSR register  */
#define ADC_CSR_ADRDY_MST                   (0x00000001)
#define ADC_CSR_EOSMP_MST                   (0x00000002)
#define ADC_CSR_EOC_MST                     (0x00000004)
#define ADC_CSR_EOS_MST                     (0x00000008)
#define ADC_CSR_OVR_MST                     (0x00000010)
#define ADC_CSR_JEOC_MST                    (0x00000020)
#define ADC_CSR_JEOS_MST                    (0x00000040)
#define ADC_CSR_AWD1_MST                    (0x00000080)
#define ADC_CSR_AWD2_MST                    (0x00000100)
#define ADC_CSR_AWD3_MST                    (0x00000200)
#define ADC_CSR_JQOVF_MST                   (0x00000400)

/*  Bit definition for ADC_CCR register  */
#define ADC_CCR_CKMODE                      (0x00030000)
#define ADC_CCR_CKMODE_0                    (0x00010000)
#define ADC_CCR_CKMODE_1                    (0x00020000)
#define ADC_CCR_PRESC                       (0x003C0000)
#define ADC_CCR_PRESC_0                     (0x00040000)
#define ADC_CCR_PRESC_1                     (0x00080000)
#define ADC_CCR_PRESC_2                     (0x00100000)
#define ADC_CCR_PRESC_3                     (0x00200000)
#define ADC_CCR_VREFEN                      (0x00400000)
#define ADC_CCR_CH17SEL                     (0x00800000)
#define ADC_CCR_CH18SEL                     (0x01000000)


#endif /* STM32L433_ADC_H_ */
